devindasrinath/AI-Robot-v1.0/esp32/sdkconfig.defaults
# ESP32-C3 target
CONFIG_IDF_TARGET="esp32c3"

# FreeRTOS tick rate 1000Hz for 1ms precision
CONFIG_FREERTOS_HZ=1000

# UART buffer sizes
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# SPI DMA
CONFIG_SPI_MASTER_IN_IRAM=y

# Optimize for performance
CONFIG_COMPILER_OPTIMIZATION_PERF=y
